Repository: mahip004/SIH
Catalog: rwh_app/l10n/arb/app_*.arb
Languages: hi

# appTitle
source: Rainwater Hub
hi: रेनवाटर हब

source: Sign in with Google
hi: गूगल से साइन इन करें

# shareLocationTitle
source: Share Location
hi: स्थान साझा करें

# shareLocationDesc
source: Do you wish to share your location? This will help auto-update rainfall and feasibility data.
hi: क्या आप अपना स्थान साझा करना चाहते हैं? इससे वर्षा और व्यवहार्यता डेटा स्वतः अपडेट करने में मदद मिलेगी।

source: Yes
hi: हाँ

source: No
hi: नहीं

# tosPrivacy
source: By signing in, you agree to our Terms of Service and Privacy Policy
hi: साइन इन करके, आप हमारी सेवा की शर्तों और गोपनीयता नीति से सहमत हैं

source: Sustainable Water Solutions
hi: सतत जल समाधान

# sustainableWaterDesc
source: Estimate rooftop rainwater harvesting potential and support groundwater conservation
hi: छत पर वर्षा जल संचयन क्षमता का अनुमान लगाएँ और भूजल संरक्षण में सहायता करें

# homeWelcomeBack
source: Welcome back, {firstName} 👋
hi: वापसी पर स्वागत है, {firstName} 👋

# homeTagline
source: Track and manage your rainwater harvesting with ease
hi: अपने वर्षा जल संचयन को आसानी से ट्रैक और प्रबंधित करें

# homeWaterInsightsTitle
source: Water Insights
hi: वॉटर इनसाइट्स

# homeWaterInsightsSub
source: See recent trends and rainfall updates
hi: हाल के रुझान और वर्षा अपडेट देखें

# homeFeasibilityTitle
source: Check Feasibility
hi: व्यवहार्यता जाँचें

# homeFeasibilitySub
source: Evaluate rooftop rainwater harvesting potential
hi: छत पर वर्षा जल संचयन क्षमता का मूल्यांकन करें

# homePastReportsTitle
source: Past Reports
hi: पिछली रिपोर्टें

# homePastReportsSub
source: View your previous feasibility results
hi: अपनी पिछली व्यवहार्यता के परिणाम देखें

# homeUsersInDistrictTitle
source: Users in Your District
hi: आपके जिले के उपयोगकर्ता

# homeUsersInDistrictSub
source: See how many others are using RWH in your area
hi: देखें आपके क्षेत्र में कितने लोग आरडब्ल्यूएच का उपयोग कर रहे हैं

source: Water Saving Tip
hi: जल संरक्षण सुझाव

# waterSavingBody
source: Harvesting rainwater from a 1,000 sq ft roof can save up to 600 gallons of water during a 1-inch rainfall. Implementing rainwater harvesting helps conserve water and reduces demand on municipal supplies.
hi: 1000 वर्ग फीट की छत से 1 इंच वर्षा में 600 गैलन तक पानी बचाया जा सकता है। वर्षा जल संचयन से पानी का संरक्षण होता है और नगरपालिका आपूर्ति पर demand कम होती है।

# feasibilityAppBar
source: Feasibility Form
hi: व्यवहार्यता फॉर्म

# feasibilityHeader
source: Check Your Feasibility
hi: अपनी व्यवहार्यता जाँचें

# feasibilitySub
source: Fill in the details to evaluate your rainwater harvesting potential
hi: वर्षा जल संचयन क्षमता का मूल्यांकन करने के लिए विवरण भरें

source: Select State
hi: राज्य चुनें

# chooseState
source: Choose your state
hi: अपना राज्य चुनें

# errorSelectState
source: Select a state
hi: कृपया राज्य चुनें

# numDwellers
source: Number of Dwellers
hi: निवासियों की संख्या

# numDwellersHint
source: Enter the number of people
hi: लोगों की संख्या दर्ज करें

# errorNumDwellers
source: Enter number of dwellers
hi: निवासियों की संख्या दर्ज करें

# roofArea
source: Roof Area (m²)
hi: छत का क्षेत्रफल (m²)

# roofAreaHint
source: Enter your roof area
hi: अपनी छत का क्षेत्रफल दर्ज करें

# errorRoofArea
source: Enter roof area
hi: छत का क्षेत्रफल दर्ज करें

source: Roof Type
hi: छत का प्रकार

# roofTypeHint
source: Select roof type
hi: छत का प्रकार चुनें

# roofTypeFlat
source: Flat
hi: समतल

# roofTypeSloping
source: Sloping
hi: ढलान

source: Roof Material
hi: छत की सामग्री

# roofMaterialHint
source: Select roof material
hi: छत की सामग्री चुनें

# roofMaterialGiSheet
source: GI Sheet
hi: जीआई शीट

# roofMaterialAsbestos
source: Asbestos
hi: एस्बेस्टस

# roofMaterialTiled
source: Tiled
hi: टाइल्ड

# roofMaterialConcrete
source: Concrete
hi: कंक्रीट

# openSpace
source: Available Open Space (m²)
hi: उपलब्ध खुला स्थान (m²)

# openSpaceHint
source: Enter available open space
hi: उपलब्ध खुला स्थान दर्ज करें

# errorOpenSpace
source: Enter open space area
hi: खुले स्थान का क्षेत्रफल दर्ज करें

# checkFeasibilityCta
source: Check Feasibility
hi: व्यवहार्यता जाँचें

source: Did you know?
hi: क्या आप जानते हैं?

# didYouKnowBody
source: The roof material significantly affects how much rainwater you can collect. GI sheets have the highest collection efficiency.
hi: छत की सामग्री इस बात को प्रभावित करती है कि आप कितना वर्षा जल एकत्र कर सकते हैं। जीआई शीट्स की दक्षता सबसे अधिक होती है।

# profileTitle
source: Profile
hi: प्रोफ़ाइल

source: Guest
hi: अतिथि

source: Username
hi: उपयोगकर्ता नाम

source: District
hi: ज़िला

# enterDistrict
source: Enter your district
hi: अपना ज़िला दर्ज करें

source: District updated!
hi: ज़िला अपडेट किया गया!

# districtUpdateError
source: Error updating district: {error}
hi: ज़िला अपडेट करने में त्रुटि: {error}

source: Logout
hi: लॉगआउट

source: Choose Language
hi: भाषा चुनें

# languageEnglish
source: English
hi: अंग्रेज़ी

# languageHindi
source: Hindi
hi: हिन्दी

# usersInDistrictTitle
source: Users in Your District
hi: आपके जिले के उपयोगकर्ता

# districtHeader
source: 🌎 {district} District
hi: 🌎 {district} ज़िला

# usersCount
source: There are {count} users from your district using {app}
hi: आपके जिले से {count} उपयोगकर्ता {app} का उपयोग कर रहे हैं

# usersEmpty
source: Be the first to start rainwater harvesting in your district!
hi: अपने जिले में वर्षा जल संचयन शुरू करने वाले पहले व्यक्ति बनें!

# usersJoinOthers
source: Join others in your district and make a difference! Encourage your friends and neighbors to start harvesting rainwater.
hi: अपने जिले के अन्य लोगों के साथ जुड़ें और बदलाव लाएँ! अपने मित्रों और पड़ोसियों को वर्षा जल संचयन शुरू करने के लिए प्रोत्साहित करें।

# noDistrictTitle
source: District not set!
hi: ज़िला सेट नहीं है!

# noDistrictDesc
source: Please set your district in your profile to see other users from your area.
hi: अपने क्षेत्र के अन्य उपयोगकर्ताओं को देखने के लिए कृपया प्रोफ़ाइल में अपना ज़िला सेट करें।

source: Go to Profile
hi: प्रोफ़ाइल पर जाएँ

# pastReportsTitle
source: Past Reports
hi: पिछली रिपोर्टें

# previousReportsHeader
source: Your Previous Feasibility Reports
hi: आपकी पिछली व्यवहार्यता रिपोर्टें

# noSavedReports
source: No saved reports yet
hi: अभी तक कोई सहेजी गई रिपोर्ट नहीं

# generateToSeeHere
source: Generate a feasibility report to see it here
hi: यहाँ देखने के लिए एक व्यवहार्यता रिपोर्ट बनाएं

# dateLabel
source: Date:
hi: तारीख:

# suggestedStructureLabel
source: Suggested Structure:
hi: सुझाई गई संरचना:

# stateLabel
source: State:
hi: राज्य:

# roofAreaLabel
source: Roof Area:
hi: छत का क्षेत्रफल:

# deleteReportTitle
source: Delete Report
hi: रिपोर्ट हटाएँ

# deleteReportConfirm
source: Are you sure you want to delete this report?
hi: क्या आप वाकई इस रिपोर्ट को हटाना चाहते हैं?

source: Cancel
hi: रद्द करें

source: Delete
hi: हटाएँ

# reportDeleted
source: Report deleted successfully
hi: रिपोर्ट सफलतापूर्वक हटाई गई

# failedDelete
source: Failed to delete report
hi: रिपोर्ट हटाने में विफल

# feasibilityReportTitle
source: Feasibility Report
hi: व्यवहार्यता रिपोर्ट

# insightsHeader
source: Rainwater Harvesting Insights
hi: वर्षा जल संचयन इनसाइट्स

# insightsSub
source: Based on your location and property details
hi: आपके स्थान और संपत्ति विवरण के आधार पर

source: Storage Tank
hi: स्टोरेज टैंक

source: Recharge Structure
hi: रीचार्ज संरचना

# runoffCapacity
source: Runoff Generation Capacity
hi: रनऑफ जनरेशन क्षमता

source: Required Tank Capacity
hi: आवश्यक टैंक क्षमता

source: Cost Estimation & Benefit
hi: लागत अनुमान और लाभ

# soilTypeLabel
source: Soil Type
hi: मृदा प्रकार

source: Back
hi: वापस

source: Save Report
hi: रिपोर्ट सहेजें

source: Saving...
hi: सहेजा जा रहा है...

source: Download PDF
hi: पीडीएफ डाउनलोड करें

source: Error generating PDF
hi: पीडीएफ जनरेट करने में त्रुटि

# volumeLabel
source: Volume
hi: आयतन

# dimensionsLabel
source: Dimensions
hi: आयाम

# loadingPipe
source: Loading pipe dimensions...
hi: पाइप आयाम लोड हो रहे हैं...

# pipeInfo
source: Pipe: {diameter} mm dia × {width} mm width
hi: पाइप: {diameter} मिमी व्यास × {width} मिमी चौड़ाई

# noSuitablePipe
source: No suitable pipe found
hi: उपयुक्त पाइप नहीं मिला

source: Recommended Dimensions
hi: अनुशंसित आयाम

source: Estimated Runoff Available
hi: अनुमानित उपलब्ध रनऑफ

# litresPerYear
source: {litres} L/year
hi: {litres} एल/वर्ष

# personsDays
source: For {persons} persons, {days} days
hi: {persons} व्यक्ति, {days} दिन
